In [52]:
%matplotlib inline
import pandas as pd

In [53]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

In [54]:
titles = pd.DataFrame.from_csv('data/titles.csv', index_col=None)
titles.head()

                              title  year
0                                 8  2007
1                            Romans  2016
2                       Ultra-Toxic  2005
3                     The Candy Man  1969
4  Friends & Lovers: The Ski Trip 2  2008

In [55]:
cast = pd.DataFrame.from_csv('data/cast.csv', index_col=None)
cast.head()

                    title  year     name   type                character     n
0         Suuri illusioni  1985   Homo $  actor                   Guests  22.0
1     Battle of the Sexes  2017  $hutter  actor          Bobby Riggs Fan  10.0
2    Secret in Their Eyes  2015  $hutter  actor          2002 Dodger Fan   NaN
3              Steve Jobs  2015  $hutter  actor  1988 Opera House Patron   NaN
4  Straight Outta Compton  2015  $hutter  actor              Club Patron   NaN

### How many movies are listed in the titles dataframe?

In [56]:
len(titles['title'])

229882

### What are the earliest two films listed in the titles dataframe?

In [57]:
titles.sort_values('year').head(2)

                     title  year
120739          Miss Jerry  1894
219516  The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [58]:
duplicates = titles.groupby('title').count()
duplicates.columns = ['duplicates']
duplicates.ix['Hamlet'][0]

19

### How many movies are titled "North by Northwest"?

In [59]:
duplicates.ix['North by Northwest'][0]

1

### When was the first movie titled "Hamlet" made?

In [60]:
titles.query("title == 'Hamlet'").sort_values('year').iloc[0][1]

1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [61]:
titles.query("title == 'Treasure Island'").sort_values('year')

                  title  year
180978  Treasure Island  1918
205617  Treasure Island  1920
209569  Treasure Island  1934
136811  Treasure Island  1950
43994   Treasure Island  1972
45301   Treasure Island  1973
122800  Treasure Island  1985
64621   Treasure Island  1999

### How many movies were made in the year 1950?

In [62]:
len(titles.query("year == 1950"))

1081

### How many movies were made in the year 1960?

In [63]:
len(titles.query("year == 1960"))

1488

### How many movies were made from 1950 through 1959?

In [64]:
len(titles.query("year >= 1950 & year < 1960"))

12602

### In what years has a movie titled "Batman" been released?

In [65]:
titles.query("title == 'Batman'")[['year']]

        year
107587  1943
201542  1989

### How many roles were there in the movie "Inception"?

In [66]:
len(cast.query("title == 'Inception'")[['character']])

77

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [67]:
len(cast.fillna(0).query("title == 'Inception' & n == 0")[['character']])

26

### But how many roles in the movie "Inception" did receive an "n" value?

In [68]:
len(cast.fillna(0).query("title == 'Inception' & n != 0")[['character']])

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [69]:
cast.fillna(0).query("title == 'North by Northwest' & n != 0").sort_values(['n'])[['name', 'type', 'character', 'n']]

                         name     type                    character     n
828313             Cary Grant    actor           Roger O. Thornhill   1.0
3311904       Eva Marie Saint  actress                  Eve Kendall   2.0
1384564           James Mason    actor              Phillip Vandamm   3.0
2979655   Jessie Royce Landis  actress              Clara Thornhill   4.0
338569         Leo G. Carroll    actor                The Professor   5.0
2880266  Josephine Hutchinson  actress                Mrs. Townsend   6.0
1611237           Philip Ober    actor              Lester Townsend   7.0
1211365         Martin Landau    actor                      Leonard   8.0
2324061         Adam Williams    actor                     Valerian   9.0
1721393          Edward Platt    actor              Victor Larrabee  10.0
632847      Robert Ellenstein    actor                        Licht  11.0
2180279          Les Tremayne    actor                   Auctioneer  12.0
441299        Philip Coolidge    actor                    Dr. Cross  13.0
1433579         Patrick McVey    actor               Sergeant Flamm  14.0
195292           Edward Binns    actor               Captain Junket  15.0
1315609             Ken Lynch    actor  Charley - Chicago Policeman  16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [70]:
cast.query("title == 'Sleuth' & year == 1972").sort_values(['n'])[['name', 'type', 'character', 'n']]

                       name     type                   character    n
1620851    Laurence Olivier    actor                 Andrew Wyke  1.0
309931        Michael Caine    actor                 Milo Tindle  2.0
355001       Alec Cawthorne    actor           Inspector Doppler  3.0
1392381  John (II) Matthews    actor  Detective Sergeant Tarrant  4.0
2581312  Eve (III) Channing  actress             Marguerite Wyke  5.0
1376603        Teddy Martin    actor      Police Constable Higgs  6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [71]:
cast.query("title == 'Sleuth' & year == 2007").sort_values(['n'])[['name', 'type', 'character', 'n']]

                        name     type          character    n
309932         Michael Caine    actor             Andrew  1.0
1228911             Jude Law    actor               Milo  2.0
1716240        Harold Pinter    actor        Man on T.V.  3.0
246374       Kenneth Branagh    actor  Other Man on T.V.  NaN
355002   Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2581311    Eve (II) Channing  actress    Marguerite Wyke  NaN
3176194    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [72]:
len(cast.query("title == 'Hamlet' & year == 1921")[['character']])

9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [73]:
len(cast.query("title == 'Hamlet' & year == 1996")[['character']])

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [74]:
len(cast.query("title == 'Hamlet'")[['character']])

313

### How many people have played an "Ophelia"?

In [76]:
len(cast.query("character == 'Ophelia'"))

107

### How many people have played a role called "The Dude"?

In [78]:
len(cast.query("character == 'The Dude'"))

17

### How many people have played a role called "The Stranger"?

In [79]:
len(cast.query("character == 'The Stranger'"))

209

### How many roles has Sidney Poitier played throughout his career?

In [80]:
len(cast.query("name == 'Sidney Poitier'"))

43

### How many roles has Judi Dench played?

In [81]:
len(cast.query("name == 'Judi Dench'"))

54

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [82]:
cast.query("name == 'Cary Grant' & year >= 1940 & year < 1950 & n == 2")[['character', 'year']].sort_values('year')

          character  year
828310         Nick  1940
828320  Roger Adams  1941

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [83]:
cast.query("name == 'Cary Grant' & year >= 1940 & year < 1950 & n == 1")[['character', 'year']].sort_values('year')

                    character  year
828335            Matt Howard  1940
828292           Walter Burns  1940
828337     C. K. Dexter Haven  1940
828325                Johnnie  1941
828339           Leopold Dilg  1942
828316  Patrick 'Pat' O'Toole  1942
828283          Capt. Cassidy  1943
828308              Joe Adams  1943
828309        Joe Bascopolous  1943
828317            Jerry Flynn  1944
828275      Mortimer Brewster  1944
828312             Ernie Mott  1944
828311            Cole Porter  1946
828314                 Devlin  1946
828331            Dick Nugent  1947
828332                 Dudley  1947
828307          Jim Blandings  1948
828287      Dr. Madison Brown  1948
828296    Capt. Henri Rochard  1949

### How many roles were available for actors in the 1950s?

In [84]:
len(cast.query("year >= 1950 & year < 1960 & type == 'actor'"))

153936

### How many roles were avilable for actresses in the 1950s?

In [85]:
len(cast.query("year >= 1950 & year < 1960 & type == 'actress'"))

55993

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [86]:
len(cast.query("year <= 1980 & n == 1"))

63537

### How many non-leading roles were available through from the beginning of film history through 1980?

In [87]:
len(cast.query("year <= 1980 & n != 1"))

1087299

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [88]:
len(cast.fillna(0).query("year <= 1980 & n == 0"))

434676